<a href="https://colab.research.google.com/github/bmnds/uea-data-science-04-data-processing/blob/main/Atividade_Pratica_Aula1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Instalação e configuração do banco de dados PostgreSQL

In [ ]:
# Pacotes necessários
import pandas as pd
from sqlalchemy import create_engine
from os import environ as env

In [ ]:
# Definindo as variávies de ambiente
from os import environ as env

%env DB_NAME=northwind
%env DB_USR=postgres
%env DB_PWD=postgres
%env DB_HOST=localhost
%env DB_PORT=5432

env: DB_NAME=northwind
env: DB_USR=postgres
env: DB_PWD=postgres
env: DB_HOST=localhost
env: DB_PORT=5432

In [ ]:
# Instalando e iniciando o PostgreSQL
# PODE DEMORAR ALGUNS MINUTOS
%%time
!sudo apt-get -y -qq update
!sudo apt-get -y -qq install postgresql
!sudo service postgresql start

debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 76, <> line 11.)
debconf: falling back to frontend: Readline
debconf: unable to initialize frontend: Readline
debconf: (This frontend requires a controlling tty.)
debconf: falling back to frontend: Teletype
dpkg-preconfigure: unable to re-open stdin:
Selecting previously unselected package cron.
(Reading database ... 144793 files and directories currently installed.)
Preparing to unpack .../00-cron_3.0pl1-128.1ubuntu1_amd64.deb ...
Unpacking cron (3.0pl1-128.1ubuntu1) ...
Selecting previously unselected package logrotate.
Preparing to unpack .../01-logrotate_3.11.0-0.1ubuntu1_amd64.deb ...
Unpacking logrotate (3.11.0-0.1ubuntu1) ...
Selecting previously unselected package netbase.
Preparing to unpack .../02-netbase_5.4_all.deb ...
Unpacking netbase (5.4) ...
Preparing to unpack .../03-libpq5_10.15-0ubuntu0.18.04.1_amd64.deb ...
Unpacking libpq5:amd64 (10.15-0ubuntu0.18.04.1) over (10.14-0ubuntu0.18.04.1) ...
Selecting previously unselected package postgresql-client-common.
Preparing to unpack .../04-postgresql-client-common_190ubuntu0.1_all.deb ...
Unpacking postgresql-client-common (190ubuntu0.1) ...
Selecting previously unselected package postgresql-client-10.
Preparing to unpack .../05-postgresql-client-10_10.15-0ubuntu0.18.04.1_amd64.deb ...
Unpacking postgresql-client-10 (10.15-0ubuntu0.18.04.1) ...
Selecting previously unselected package ssl-cert.
Preparing to unpack .../06-ssl-cert_1.0.39_all.deb ...
Unpacking ssl-cert (1.0.39) ...
Selecting previously unselected package postgresql-common.
Preparing to unpack .../07-postgresql-common_190ubuntu0.1_all.deb ...
Adding 'diversion of /usr/bin/pg_config to /usr/bin/pg_config.libpq-dev by postgresql-common'
Unpacking postgresql-common (190ubuntu0.1) ...
Selecting previously unselected package postgresql-10.
Preparing to unpack .../08-postgresql-10_10.15-0ubuntu0.18.04.1_amd64.deb ...
Unpacking postgresql-10 (10.15-0ubuntu0.18.04.1) ...
Selecting previously unselected package postgresql.
Preparing to unpack .../09-postgresql_10+190ubuntu0.1_all.deb ...
Unpacking postgresql (10+190ubuntu0.1) ...
Selecting previously unselected package sysstat.
Preparing to unpack .../10-sysstat_11.6.1-1ubuntu0.1_amd64.deb ...
Unpacking sysstat (11.6.1-1ubuntu0.1) ...
Setting up sysstat (11.6.1-1ubuntu0.1) ...
debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 76.)
debconf: falling back to frontend: Readline

Creating config file /etc/default/sysstat with new version
update-alternatives: using /usr/bin/sar.sysstat to provide /usr/bin/sar (sar) in auto mode
Created symlink /etc/systemd/system/multi-user.target.wants/sysstat.service → /lib/systemd/system/sysstat.service.
Setting up ssl-cert (1.0.39) ...
debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 76.)
debconf: falling back to frontend: Readline
Setting up libpq5:amd64 (10.15-0ubuntu0.18.04.1) ...
Setting up cron (3.0pl1-128.1ubuntu1) ...
Adding group `crontab' (GID 110) ...
Done.
Created symlink /etc/systemd/system/multi-user.target.wants/cron.service → /lib/systemd/system/cron.service.
update-rc.d: warning: start and stop actions are no longer supported; falling back to defaults
invoke-rc.d: could not determine current runlevel
invoke-rc.d: policy-rc.d denied execution of start.
Setting up logrotate (3.11.0-0.1ubuntu1) ...
Setting up netbase (5.4) ...
Setting up postgresql-client-common (190ubuntu0.1) ...
Setting up postgresql-common (190ubuntu0.1) ...
debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 76.)
debconf: falling back to frontend: Readline
Adding user postgres to group ssl-cert

Creating config file /etc/postgresql-common/createcluster.conf with new version
Building PostgreSQL dictionaries from installed myspell/hunspell packages...
Removing obsolete dictionary files:
Created symlink /etc/systemd/system/multi-user.target.wants/postgresql.service → /lib/systemd/system/postgresql.service.
invoke-rc.d: could not determine current runlevel
invoke-rc.d: policy-rc.d denied execution of start.
Setting up postgresql-client-10 (10.15-0ubuntu0.18.04.1) ...
update-alternatives: using /usr/share/postgresql/10/man/man1/psql.1.gz to provide /usr/share/man/man1/psql.1.gz (psql.1.gz) in auto mode
Setting up postgresql-10 (10.15-0ubuntu0.18.04.1) ...
debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 76.)
debconf: falling back to frontend: Readline
Creating new PostgreSQL cluster 10/main ...
/usr/lib/postgresql/10/bin/initdb -D /var/lib/postgresql/10/main --auth-local peer --auth-host md5
The files belonging to this database system will be owned by user "postgres".
This user must also own the server process.

The database cluster will be initialized with locale "en_US.UTF-8".
The default database encoding has accordingly been set to "UTF8".
The default text search configuration will be set to "english".

Data page checksums are disabled.

fixing permissions on existing directory /var/lib/postgresql/10/main ... ok
creating subdirectories ... ok
selecting default max_connections ... 100
selecting default shared_buffers ... 128MB
selecting default timezone ... Etc/UTC
selecting dynamic shared memory implementation ... posix
creating configuration files ... ok
running bootstrap script ... ok
performing post-bootstrap initialization ... ok
syncing data to disk ... ok

Success. You can now start the database server using:

    /usr/lib/postgresql/10/bin/pg_ctl -D /var/lib/postgresql/10/main -l logfile start

Ver Cluster Port Status Owner    Data directory              Log file
10  main    5432 down   postgres /var/lib/postgresql/10/main /var/log/postgresql/postgresql-10-main.log
update-alternatives: using /usr/share/postgresql/10/man/man1/postmaster.1.gz to provide /usr/share/man/man1/postmaster.1.gz (postmaster.1.gz) in auto mode
invoke-rc.d: could not determine current runlevel
invoke-rc.d: policy-rc.d denied execution of start.
Setting up postgresql (10+190ubuntu0.1) ...
Processing triggers for man-db (2.8.3-2ubuntu0.1) ...
Processing triggers for libc-bin (2.27-3ubuntu1.2) ...
/sbin/ldconfig.real: /usr/local/lib/python3.6/dist-packages/ideep4py/lib/libmkldnn.so.0 is not a symbolic link

Processing triggers for systemd (237-3ubuntu10.42) ...
 * Starting PostgreSQL 10 database server
   ...done.
CPU times: user 110 ms, sys: 41 ms, total: 151 ms
Wall time: 26.9 s

In [ ]:
# Criando o banco de dados
!sudo -u $DB_USR psql -U $DB_USR -c "ALTER USER $DB_USR PASSWORD '$DB_PWD';"

!sudo -u $DB_USR psql -c "DROP DATABASE IF EXISTS $DB_NAME;"
!sudo -u $DB_USR psql -c "CREATE DATABASE $DB_NAME;"

print(f'Banco de dados criado com o nome `{env["DB_NAME"]}`')

ALTER ROLE
NOTICE:  database "northwind" does not exist, skipping
DROP DATABASE
CREATE DATABASE
Banco de dados criado com o nome `northwind`

In [ ]:
# Rodando o script para inicialização do banco de dados (DDL + DML)
# PODE DEMORAR ALGUNS MINUTOS
%%time
!curl -o northwind.sql -s -OL 'https://drive.google.com/uc?export=download&id=10kOWwu6Xf8g8X8iW-p9rOu7qCTFl1KIO'
!sudo -u $DB_USR psql -d $DB_NAME -q -f northwind.sql

print(f'Arquivo `northwind.sql` baixado e executado com sucesso!')

Arquivo `northwind.sql` baixado e executado com sucesso!
CPU times: user 27.2 ms, sys: 11 ms, total: 38.1 ms
Wall time: 9.06 s

In [ ]:
# Conectando com o banco de dados PostgreSQL
db_string = f'postgresql://{env["DB_USR"]}:{env["DB_PWD"]}@{env["DB_HOST"]}:{env["DB_PORT"]}/{env["DB_NAME"]}'
db = create_engine(db_string)

print(pd.read_sql_query("SELECT 'Olá, Postgres!' AS TESTE_DE_CONEXAO;",con=db).head())
print(f'Conexão com o banco de dados estabelecida com sucesso!')
db.dispose()

  teste_de_conexao
0   Olá, Postgres!
Conexão com o banco de dados estabelecida com sucesso!

/usr/local/lib/python3.6/dist-packages/psycopg2/__init__.py:144: UserWarning: The psycopg2 wheel package will be renamed from release 2.8; in order to keep installing from binary please use "pip install psycopg2-binary" instead. For details see: <http://initd.org/psycopg/docs/install.html#binary-install-from-pypi>.
  """)

# Consultando o banco de dados PostgreSQL

In [ ]:
# funções utilitárias
def print_number_of_rows(df):
  rows, cols = df.shape
  print(f'A consulta retornou {rows} registros')

In [ ]:
# 1. Quais os 10 produtos mais caros?
sql = """
  SELECT DISTINCT products.product_name, products.unit_price 
  FROM products 
  ORDER BY products.unit_price DESC
  LIMIT 10
"""
df = pd.read_sql_query(sql, con=db)
df

              product_name  unit_price
0            Côte de Blaye      263.50
1  Thüringer Rostbratwurst      123.79
2          Mishi Kobe Niku       97.00
3   Sir Rodney's Marmalade       81.00
4         Carnarvon Tigers       62.50
5     Raclette Courdavault       55.00
6    Manjimup Dried Apples       53.00
7           Tarte au sucre       49.30
8              Ipoh Coffee       46.00
9        Rössle Sauerkraut       45.60

In [ ]:
# 2. Quais clientes fizeram pedidos no último trimestre do ano de 1996?
sql = """
  SELECT DISTINCT customers.customer_id, customers.company_name, customers.city, customers.country
  FROM customers 
  RIGHT JOIN orders 
    ON customers.customer_id = orders.customer_id
  WHERE orders.order_date BETWEEN date'1996-10-01' AND date'1996-12-31';
"""

df = pd.read_sql_query(sql, con=db)
print_number_of_rows(df)
df.head()

A consulta retornou 45 registros

  customer_id               company_name         city country
0       ANTON    Antonio Moreno Taquería  México D.F.  Mexico
1       AROUT            Around the Horn       London      UK
2       BERGS         Berglunds snabbköp        Luleå  Sweden
3       BLONP   Blondesddsl père et fils   Strasbourg  France
4       BOLID  Bólido Comidas preparadas       Madrid   Spain

In [ ]:
# 3. Cálculo do subtotal para cada produto incluído no pedido
sql = """
  SELECT DISTINCT 
      order_details.order_id, 
      order_details.product_id,
      products.product_name, 
      order_details.unit_price, 
      order_details.quantity,
      order_details.discount, 
      round(CAST(unit_price * quantity * (1-discount) AS NUMERIC),2) AS product_subtotal
  FROM products 
  NATURAL JOIN order_details
  ORDER BY order_details.order_id;
"""

df = pd.read_sql_query(sql, con=db)
print_number_of_rows(df)
df.head()

A consulta retornou 1493 registros

   order_id  product_id  ... discount  product_subtotal
0     10248          72  ...      0.0             174.0
1     10498          24  ...      0.0              63.0
2     10498          40  ...      0.0              92.0
3     10498          42  ...      0.0             420.0
4     10499          28  ...      0.0             912.0

[5 rows x 7 columns]

In [ ]:
# 4. Produtos com preço abaixo do valor médio

sql = """
  SELECT products.product_name, products.unit_price
  FROM products
  WHERE products.unit_price < (SELECT AVG(unit_price) FROM products)
  ORDER BY products.unit_price DESC
"""

df = pd.read_sql_query(sql, con=db)
print_number_of_rows(df)
df.head()

A consulta retornou 52 registros

                   product_name  unit_price
0                Sirop d'érable       28.50
1                    Gravad lax       26.00
2         Nord-Ost Matjeshering       25.89
3  Grandma's Boysenberry Spread       25.00
4                  Pâté chinois       24.00

In [ ]:
# 5. Cálculo do valor total do pedido
sql = """
  SELECT order_id, sum(round(CAST(unit_price * quantity * (1-discount) AS NUMERIC),2)) AS order_total
  FROM order_details
  GROUP BY order_id
"""

df = pd.read_sql_query(sql, con=db)
print_number_of_rows(df)
df.head()

A consulta retornou 830 registros

   order_id  order_total
0     11038       732.60
1     10782        12.50
2     10725       287.80
3     10423      1020.00
4     10518      4150.05

In [ ]:
# 6. Vendas por ano (trabalho em equipe)

In [ ]:
# 7. Produtos vendidos em 1995 (trabalho em equipe)

In [ ]:
# 8. Vendas por Categoria (trabalho em equipe)